# St7SetHRABaseCombinationFactor

Sets the result factor for the Base Displacement, Base Velocity or Base Acceleration case in harmonic time results.

long St7SetHRABaseCombinationFactor(long uID, double Factor)

Input Parameters

uID

Strand7 model file ID.

Factor

Factor value.

Harmonic Time Combination